<p>For our purpose, we will need two dataframes. We can create a DataFrame using any <a href="https://data-flair.training/blogs/python-variables-and-data-types/" data-attribute="8"><strong>data type</strong></a> like list, dictionary, or series. We can also use a NumPy and array or another DataFrame to create it. Letâ€™s use a <a href="https://data-flair.training/blogs/python-dictionaries/" data-attribute="9"><strong>dictionary</strong> </a>for now.</p>

In [9]:
import pandas
data = pandas.read_csv('supermarket.csv')
#  Check if a column have not a number data
pandas.isnull(data).any()

emp_id       False
dept_name    False
aisle         True
dtype: bool

<p>To drop this record, we use the following command-</p>

In [10]:
data.dropna()

   emp_id    dept_name  aisle
0       1        duvet    6.0
4       5  electronics   10.0

In [11]:
data

   emp_id    dept_name  aisle
0       1        duvet    6.0
1       2        bidet    NaN
2       3     footwear    NaN
3       4     clothing    NaN
4       5  electronics   10.0